customer-service/app/services/events/order_listener.rb

  def increment_customer_orders_count(customer_id, order_id)
    customer = Customer.find(customer_id)

    if customer
      customer.increment!(:orders_count)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = 99999 LIMIT 1
UPDATE "customers" SET "orders_count" = COALESCE("orders_count", 0) + 1 WHERE "customers"."id" = 2