order-service/app/controllers/api/v1/orders_controller.rb

  def show
    order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1

  def create
    result = Orders::Creator.call(order_params)

    if result.success?
      render json: {
        message: 'Order created successfully',
        order: result.order,
        customer: result.customer_data
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = 1 ORDER BY "orders"."created_at" DESC