customer-service/app/services/customers/creator.rb

  def create_customer
    return if error_type.present?

    @customer = Customer.new(@customer_params)

    unless @customer.save
---
INSERT INTO "customers" ("name", "email", "address", "phone", "orders_count", "created_at", "updated_at") VALUES ('Test E2E Cliente', 'test.e2e@example.com', 'Calle Test #123', '+57 300 000 0000', 0, '2025-10-20 18:40:24.748219', '2025-10-20 18:40:24.748219') RETURNING "id"