customer-service/app/services/customers/lister.rb

  def call
    customers = Customer.recent

    {
      customers: customers.map { |c| CustomerSerializer.new(c).as_json },
      total: customers.count
---
SELECT COUNT(*) FROM "customers"