customer-service/app/services/customers/presenter_service.rb

  def fetch_customer
    customer = Customer.find(@customer_id)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = 4 LIMIT 1