customer-service/app/services/customers/show_service.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = 1 LIMIT 1
---
  def fetch_customer
    customer = Customer.find(@customer_id)