order-service/app/services/orders/creator.rb

  def create_order
    return if error_type.present?

    @order = Order.new(@order_params)

    unless @order.save
---
INSERT INTO "orders" ("customer_id", "product_name", "quantity", "price", "status", "created_at", "updated_at") VALUES (1, 'Laptop', 2, 1500.0, 'pending', '2025-10-20 17:52:40.319741', '2025-10-20 17:52:40.319741') RETURNING "id"