order-service/app/jobs/publish_order_event_job.rb

  def perform(order_id, customer_data)
    Rails.logger.info "Publishing event for Order ##{order_id}"

    order = Order.find(order_id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1